In [1]:
import numpy as np
from IPython.display import display
import pandas as pd

In [3]:
df = pd.DataFrame({'A':[None, 2, 3, None, 5], 'B':[10, None, None, 40, 50], 'C':[100, None, 300, 400,
None]})

In [15]:
df.dropna()

Empty DataFrame
Columns: [A, B, C]
Index: []

In [19]:
df.dropna(how='all')

     A     B      C
0  NaN  10.0  100.0
1  2.0   NaN    NaN
2  3.0   NaN  300.0
3  NaN  40.0  400.0
4  5.0  50.0    NaN

In [21]:
df.dropna(subset=['A', 'C'])

     A   B      C
2  3.0 NaN  300.0

In [29]:
df.fillna(2)

     A     B      C
0  2.0  10.0  100.0
1  2.0   2.0    2.0
2  3.0   2.0  300.0
3  2.0  40.0  400.0
4  5.0  50.0    2.0

In [39]:
df['B'] = df['B'].fillna(df['B'].mean())
df

     A          B      C
0  NaN  10.000000  100.0
1  2.0  33.333333    NaN
2  3.0  33.333333  300.0
3  NaN  40.000000  400.0
4  5.0  50.000000    NaN